БухЭксп/Catalogs/CW_МакросыШаблоновДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_МакросыШаблоновДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеШаблона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредопределеннаяФункция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПредопреленныеФункцииШаблоновДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКДанным</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рассчитывается</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВывода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬЗначениеКонтрольнойДаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬРеквизитОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬМониторинговыйПараметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬМониторинговыйПараметрРеквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬФорматВыводаРеквизитаОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПредопреленныеФункцииШаблоновДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПредопреленныеФункцииШаблоновДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяМетода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФункции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеНазначенияШаблонов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НазначениеШаблона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_МакросыШаблоновДокументов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_ШаблоныДокументовСерверВызовСервера.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);  

	СтрокаРеквизитОбъекта = "ОбъектПечати";  
	
	Формула.УстановитьТекст(Объект.Формула);  
	
	УстановитьДоступностьЭлементовФормы();
	УстановитьВидимостьЭлементов();   
	
	Элементы.ПредопределеннаяФункция.Видимость = ЗначениеЗаполнено(Объект.ПредопределеннаяФункция);

	Элементы.ФорматВывода.Видимость = ПолучитьВидимостьФорматаВывода();  
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы() 
	
	Если ЗначениеЗаполнено(Объект.ПредопределеннаяФункция) Тогда
		ТолькоПросмотр = истина;
		Элементы.Формула.ТолькоПросмотр = Истина;
		Возврат;
	КонецЕсли;
	
	РедактированиеДоступно 	= CW_ШаблоныДокументовСерверВызовСервера.ПолучитьПравоРедактированияШаблона(Объект.Ссылка, Объект.НазначениеШаблона);
	ТолькоПросмотр 			= Не РедактированиеДоступно ; 
	            
	Элементы.ГруппаЗначениеПараметра.Доступность	= РедактированиеДоступно;
	Элементы.Формула.Доступность 					= РедактированиеДоступно;
	Элементы.УстановитьИдентификатор.Доступность 	= РедактированиеДоступно;
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Формула = Формула.ПолучитьТекст();
	Если Объект.Ссылка.Пустая() Тогда 
		//При записи нового оъекта из формы
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ОбновитьПовторноИспользуемыеЗначения", Истина);	
	КонецЕсли; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	НаименованиеПриИзмененииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзмененииНаКлиенте()
	
	Если НЕ ЗначениеЗаполнено(Объект.Идентификатор) Тогда  
		Объект.Идентификатор 	= ИдентификаторПоПредставлению();
	КонецЕсли;

КонецПроцедуры   

&НаКлиенте
Процедура НазначениеШаблонаПриИзменении(Элемент) 
	
	Объект.Идентификатор = ИдентификаторПоПредставлению(); 
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьИдентификатор(Команда) 
	
	Объект.Идентификатор = ИдентификаторПоПредставлению(); 
	
КонецПроцедуры

&НаСервере
Функция ИдентификаторПоПредставлению()
	
	Идентификатор	= CW_ШаблоныДокументовСерверВызовСервера.ПолучитьИдентификаторПоТексту(СокрЛП(Объект.Наименование));
	
	КодУникальности = 0;
	ПолучитьУникальностьИдетификатора(Идентификатор, КодУникальности, Объект.Ссылка);

	Идентификатор = Идентификатор + Формат(КодУникальности, "ЧН=' '; ЧГ=0");
	
	Возврат СокрЛП(Идентификатор);
	
КонецФункции    

&НаСервере
Функция ПолучитьСоответствиеСуффикса()

	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам"), "дг");
	Соответствие.Вставить(Тип("СправочникСсылка.CW_ПриложенияКДоговорам"), 		"пд");
	Соответствие.Вставить(Тип("СправочникСсылка.CW_Заявки"), 					"зя");
	Соответствие.Вставить(Тип("СправочникСсылка.CW_Заказы"), 					"зк");
	Соответствие.Вставить(Тип("СправочникСсылка.CW_Грузоперевозки"), 			"гп");  
	
	Возврат Соответствие;

КонецФункции

&НаСервере
Процедура ПолучитьУникальностьИдетификатора(Знач Идентификатор, КодУникальности, ТекущаяСсылка)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_МакросыШаблоновДокументов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_МакросыШаблоновДокументов КАК CW_МакросыШаблоновДокументов
	               |ГДЕ
	               |	CW_МакросыШаблоновДокументов.Идентификатор = &Идентификатор
	               |	И CW_МакросыШаблоновДокументов.НазначениеШаблона = &НазначениеШаблона
	               |	И CW_МакросыШаблоновДокументов.Ссылка <> &Ссылка";   
	
	Запрос.УстановитьПараметр("Ссылка", 			ТекущаяСсылка);
	Запрос.УстановитьПараметр("НазначениеШаблона", 	Объект.НазначениеШаблона);
	Запрос.УстановитьПараметр("Идентификатор", 		Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	КодУникальности = КодУникальности + 1;  
	Идентификатор 	= Идентификатор + Формат(КодУникальности, "ЧГ=0");
	
	ПолучитьУникальностьИдетификатора(Идентификатор, КодУникальности, ТекущаяСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РассчитываетсяПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();

КонецПроцедуры       

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	 
	Элементы.Формула.Видимость					= (Объект.Рассчитывается = 2 или Объект.Рассчитывается = 0);
	Элементы.КоманднаяПанельФормула.Видимость	= (Объект.Рассчитывается = 2); 
	Элементы.ГруппаРеквизитОбъекта.Видимость	= (Объект.Рассчитывается = 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПредопределеннуюФункцию(Команда)
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Ложь);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборФункцииЗавершение", ЭтотОбъект);	
	
	ОткрытьФорму("Справочник.CW_ПредопреленныеФункцииШаблоновДокументов.ФормаВыбора",ПараметрыФормыВыбора,ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры   

&НаКлиенте
Процедура ВыборФункцииЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ИмяФункции = ПолучитьИмяМетодаФункции(РезультатВыбора);
	
	ТекстФормулы = Формула.ПолучитьТекст();
	Формула.УстановитьТекст(СокрЛП(ТекстФормулы + " " + ИмяФункции));
	
КонецПроцедуры   

&НаСервереБезКонтекста
Функция ПолучитьИмяМетодаФункции(РезультатВыбора)
	 Возврат  СокрЛП(РезультатВыбора.ИмяМетода);
КонецФункции

&НаКлиенте
Процедура РеквизитОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;  

	ПараметрыФормы = новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",			Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",	Истина);
	ПараметрыФормы.Вставить("ОбъектПечати", 		Объект.НазначениеШаблона);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборЭлементаЗавершение", ЭтотОбъект);

	ОткрытьФорму("Справочник.CW_МакросыШаблоновДокументов.Форма.ФормаВыбораРеквизита",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ВыборЭлементаЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;                                       
	
	Объект.ПутьКДанным = ВыбранноеЗначение;  
	
	Элементы.ФорматВывода.Видимость = ПолучитьВидимостьФорматаВывода(); 
	Объект.ФорматВывода = "";	
	
КонецПроцедуры   

&НаКлиенте
Процедура РеквизитОбъектаПриИзменении(Элемент)   
	
	Элементы.ФорматВывода.Видимость = ПолучитьВидимостьФорматаВывода(); 
	Объект.ФорматВывода = "";	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидимостьФорматаВывода()  
	
	Если ПустаяСтрока(Объект.ПутьКДанным) Тогда
		Возврат Ложь;
	КонецЕсли;

	мПримитивныеТипы = ПолучитьДоступныеТипыФорматаВывода();   
	
	Схема = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьСхемуКомпоновкиДанных(ТипЗнч(Объект.НазначениеШаблона.ЗначениеПустойСсылки));
	
	НаборДанных = Схема.НаборыДанных.Получить(0);
	НаборДанных.Запрос = СтрЗаменить(НаборДанных.Запрос, "ВЫБРАТЬ", "ВЫБРАТЬ ПЕРВЫЕ 1"); 
	
	АдресСхемы 	= ПоместитьВоВременноеХранилище(Схема, Новый УникальныйИдентификатор);
	
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	
	ПолеВыбор = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных")); 
	ПолеВыбор.Поле = Новый ПолеКомпоновкиДанных(Объект.ПутьКДанным); 
	ПолеВыбор.Использование = Истина;  
	
	КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки 	= КомпоновщикМакета.Выполнить(Схема, КомпоновщикНастроек.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных;    
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	ПроцессорВыводаРезультата 	= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;    
	ПроцессорВыводаРезультата.УстановитьОбъект(ТаблицаЗначений);
	ПроцессорВыводаРезультата.Вывести(ПроцессорКомпоновкиДанных); 
	
	Колонка = ТаблицаЗначений.Колонки[1];
	
	Типы = Новый Массив;
	Для Каждого Тип из Колонка.ТипЗначения.Типы() Цикл
		Если мПримитивныеТипы.Найти(Тип) <> Неопределено Тогда
			Типы.Добавить(Тип);                                
		КонецЕсли;
	КонецЦикла;  

	Если Типы.Количество() > 0 Тогда
		ДоступныеТипыФормата = Новый ФиксированныйМассив(Типы); 
		Возврат Истина;
	КонеЦЕсли;   
	
	Возврат Ложь; 
	
КонецФункции

&НаКлиенте
Процедура ДобавитьМакрос(Команда)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("НазначениеШаблона", Объект.НазначениеШаблона);
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормыВыбора.Вставить("Отбор", СтруктураОтбора);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборПараметраЗавершение", ЭтотОбъект);	
	
	ОткрытьФорму("Справочник.CW_МакросыШаблоновДокументов.ФормаВыбора",ПараметрыФормыВыбора,ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры           

&НаСервере
Функция ПолучитьИдентификатор(РезультатВыбора)
	Возврат	СокрЛП(РезультатВыбора.Идентификатор);
КонецФункции

&НаКлиенте
Процедура ФорматВыводаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;  
	
	МассивТипов = ПолучитьДоступныеТипы();

	ДоступныеТипы = Новый ОписаниеТипов(МассивТипов);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборФорматаВыводаЗавершение",ЭтотОбъект);
	
	Конструктор = Новый КонструкторФорматнойСтроки(Объект.ФорматВывода);
	Конструктор.ДоступныеТипы 	= ДоступныеТипы;
	Конструктор.Показать(ОписаниеОповещения);
	
КонецПроцедуры  
  
&НаКлиенте
Процедура ВыборФорматаВыводаЗавершение(Текст, ДополнительныеПараметры) Экспорт 
	
	Если Текст = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Объект.ФорматВывода = Текст;
	ЭтаФорма.Модифицированность = Истина;   
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьДоступныеТипы()
	
	Если ТипЗнч(ДоступныеТипыФормата) = Тип("ФиксированныйМассив") Тогда
		Массив = Новый Массив(ДоступныеТипыФормата);
	Иначе
		Массив = ПолучитьДоступныеТипыФорматаВывода();
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

&НаСервере
Функция ПолучитьДоступныеТипыФорматаВывода()
	
	мПримитивныеТипы = Новый Массив;
	мПримитивныеТипы.Добавить(Тип("Дата"));
	мПримитивныеТипы.Добавить(Тип("Число"));
	мПримитивныеТипы.Добавить(Тип("Булево")); 
	
	Возврат мПримитивныеТипы;

КонецФункции
